#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for staging</summary>

```terraform
Acquiring state lock. This may take a few moments...
module.database.random_password.db_password: Refreshing state... [id=none]
module.ocr_service.data.aws_ami.amazon_linux_2023: Reading...
module.vpc.aws_vpc.this: Refreshing state... [id=vpc-0e9e18930ef88c110]
aws_iam_user.s3_user: Refreshing state... [id=receiptly-staging-s3-user]
module.receipts_bucket.aws_s3_bucket.this: Refreshing state... [id=receiptly-staging-receipts]
aws_iam_access_key.s3_user: Refreshing state... [id=AKIA5ZJTSBRRPYO6ZRE3]
module.ocr_service.data.aws_ami.amazon_linux_2023: Read complete after 2s [id=ami-027f7434c35d68dfc]
module.vpc.aws_internet_gateway.this: Refreshing state... [id=igw-0bedeb80bec5b2047]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0e8a434bd9198528f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0a540a4c0e12426fc]
module.vpc.aws_security_group.ecs_tasks: Refreshing state... [id=sg-0b7371ff82e8b48c0]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-00d9100ad1f118849]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0adbf1468ec987d49]
module.database.aws_security_group.db: Refreshing state... [id=sg-058849943895f9d26]
module.vpc.aws_route_table.public: Refreshing state... [id=rtb-0b625edc48ea5375d]
module.database.aws_db_subnet_group.main: Refreshing state... [id=receiptly-staging-db-subnet-group]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02eb9ac0513ff3a99]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-072f3a00f992c72b6]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-03b1b367e0b9a1d2c]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0ab18dbd12bc26af5]
module.receipts_bucket.aws_s3_bucket_public_access_block.this: Refreshing state... [id=receiptly-staging-receipts]
aws_iam_user_policy.s3_access: Refreshing state... [id=receiptly-staging-s3-user:receiptly-staging-s3-access]
module.receipts_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=receiptly-staging-receipts]
module.receipts_bucket.aws_s3_bucket_server_side_encryption_configuration.this: Refreshing state... [id=receiptly-staging-receipts]
module.receipts_bucket.aws_s3_bucket_lifecycle_configuration.this[0]: Refreshing state... [id=receiptly-staging-receipts]
module.database.aws_db_instance.postgres: Refreshing state... [id=db-TDQZS5QV6QUDSFCKY7EYV7FNQE]
module.secrets.aws_secretsmanager_secret.this["receiptly/s3/credentials"]: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:947685297250:secret:receiptly/s3/credentials-9FxMyd]
module.secrets.aws_secretsmanager_secret.this["receiptly/database/credentials"]: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:947685297250:secret:receiptly/database/credentials-SDTw9J]
module.secrets.aws_secretsmanager_secret_version.this["receiptly/database/credentials"]: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:947685297250:secret:receiptly/database/credentials-SDTw9J|terraform-20251115032513873300000002]
module.secrets.aws_secretsmanager_secret_version.this["receiptly/s3/credentials"]: Refreshing state... [id=arn:aws:secretsmanager:ap-southeast-1:947685297250:secret:receiptly/s3/credentials-9FxMyd|terraform-20251115022819968700000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.ocr_service.aws_iam_instance_profile.ocr_instance will be created
  + resource "aws_iam_instance_profile" "ocr_instance" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "receiptly-staging-ocr-profile-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "Environment" = "staging"
          + "Name"        = "receiptly-staging-ocr-instance-profile"
          + "Project"     = "receiptly"
        }
      + tags_all    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-ocr-instance-profile"
          + "Project"     = "receiptly"
        }
      + unique_id   = (known after apply)
    }

  # module.ocr_service.aws_iam_role.ocr_instance will be created
  + resource "aws_iam_role" "ocr_instance" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "receiptly-staging-ocr-role-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "staging"
          + "Name"        = "receiptly-staging-ocr-instance-role"
          + "Project"     = "receiptly"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-ocr-instance-role"
          + "Project"     = "receiptly"
        }
      + unique_id             = (known after apply)
    }

  # module.ocr_service.aws_iam_role_policy.ocr_secrets_access will be created
  + resource "aws_iam_role_policy" "ocr_secrets_access" {
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "secrets-access-"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-southeast-1:*:secret:receiptly/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchCheckLayerAvailability",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:BatchGetImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ocr_service.aws_instance.ocr_service will be created
  + resource "aws_instance" "ocr_service" {
      + ami                                  = "ami-027f7434c35d68dfc"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-00d9100ad1f118849"
      + tags                                 = {
          + "Environment" = "staging"
          + "Name"        = "receiptly-staging-ocr-service"
          + "Project"     = "receiptly"
          + "Service"     = "python-ocr"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-ocr-service"
          + "Project"     = "receiptly"
          + "Service"     = "python-ocr"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "288f8cee303c745e84c7188e395a0a2bb40e1bd2"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 8
          + volume_type           = "gp2"
        }
    }

  # module.ocr_service.aws_security_group.ocr_service will be created
  + resource "aws_security_group" "ocr_service" {
      + arn                    = (known after apply)
      + description            = "Security group for Python OCR service EC2 instance"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Python OCR service"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
          + {
              + cidr_blocks      = []
              + description      = "SSH access"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "receiptly-staging-ocr-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "Name"        = "receiptly-staging-ocr-sg"
          + "Project"     = "receiptly"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "receiptly-staging-ocr-sg"
          + "Project"     = "receiptly"
        }
      + vpc_id                 = "vpc-0e9e18930ef88c110"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ocr_instance_id             = (known after apply)
  + ocr_instance_public_ip      = (known after apply)
  + ocr_service_url             = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @eddykuhan, Action: `pull_request`*